/**
 * Created 2018/01/26 15:15 By lvmingyin
 */


// 炸弹人
const map = [
    ['#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#'],
    ['#', 'G', 'G', '.', 'G', 'G', 'G', '#', 'G', 'G', 'G', '.', '#'],
    ['#', '#', '#', '.', '#', 'G', '#', 'G', '#', 'G', '#', 'G', '#'],
    ['#', '.', '.', '.', '.', '.', '.', '.', '#', '.', '.', 'G', '#'],
    ['#', 'G', '#', '.', '#', '#', '#', '.', '#', 'G', '#', 'G', '#'],
    ['#', 'G', 'G', '.', 'G', 'G', 'G', '.', '#', '.', 'G', 'G', '#'],
    ['#', 'G', '#', '.', '#', 'G', '#', '.', '#', '.', '#', '#', '#'],
    ['#', '#', 'G', '.', '.', '.', 'G', '.', '.', '.', '.', '.', '#'],
    ['#', 'G', '#', '.', '#', 'G', '#', '#', '#', '.', '#', 'G', '#'],
    ['#', '.', '.', '.', 'G', '#', 'G', 'G', 'G', '.', 'G', 'G', '#'],
    ['#', 'G', '#', '.', '#', 'G', '#', 'G', '#', '.', '#', 'G', '#'],
    ['#', 'G', 'G', '.', 'G', 'G', 'G', '#', 'G', '.', 'G', 'G', '#'],
    ['#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#'],
];

const result = { x: 0, y: 0, sum: 0 };

for (let i = 1; i < map.length - 1; i++) {
    for (let j = 1; j < map[i].length - 1; j++) {
        if (map[i][j] === '.') {
            const sum = total({ map, x: i, y: j });
            if (sum > result.sum) {
                result.x = i;
                result.y = j;
                result.sum = sum;
            }
        }
    }
}

console.log(`炸弹放在(${result.x},${result.y})处，最多可消灭${result.sum}个敌人`);

function total({ map, x, y }) {
    let sum = 0;
    // 上
    for (let i = y - 1; i > 0; i--) {
        if (map[x][i] === 'G') {
            sum++;
        } else if (map[x][i] === '#') {
            break;
        }
    }

    // 下
    for (let i = y + 1; i < map[x].length - 1; i++) {
        if (map[x][i] === 'G') {
            sum++;
        } else if (map[x][i] === '#') {
            break;
        }
    }

    // 左
    for (let i = x - 1; i > 0; i--) {
        if (map[i][y] === 'G') {
            sum++;
        } else if (map[i][y] === '#') {
            break;
        }
    }

    // 右
    for (let i = x + 1; i < map.length - 1; i++) {
        if (map[i][y] === 'G') {
            sum++;
        } else if (map[i][y] === '#') {
            break;
        }
    }

    return sum;
}
